Your current configuration looks completely fine. I just ran it using my test account and it works for me. Here is the full transcript from my console:

```
~ # cat something01.tf 
terraform {
  required_providers {
    upcloud = {
      source = "UpCloudLtd/upcloud"
      version = "2.1.3"
    }
  }
}

variable "ssh_key_public" {
  type = string
  default = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIEldJlXojPrCK17MZK94hJam2Nhjwuj2wdFpZpqNGhVK"
}

resource "upcloud_storage" "something01" {
  title = "something01"
  zone  = "us-chi1"
  size  = 25
  tier  = "maxiops"
}

resource "upcloud_server" "something01" {
  title    = "something01"
  hostname = "something01"
  zone     = "us-chi1"
  plan     = "1xCPU-1GB"
  metadata = true
  firewall = false

  template {
    storage = "Ubuntu Server 20.04 LTS (Focal Fossa)"
    size    = 25
    address = "virtio"
  }

  storage_devices {
    type = "disk"
    address = "virtio"
    storage = upcloud_storage.something01.id
  }

  network_interface {
    type                = "public"
    ip_address_family   = "IPv4"
    bootable            = false
    source_ip_filtering = true
  }

  network_interface {
    type                = "public"
    ip_address_family   = "IPv6"
    bootable            = false
    source_ip_filtering = true
  }

  network_interface {
    type                = "utility"
    ip_address_family   = "IPv4"
    bootable            = false
    source_ip_filtering = true
  }

  login {
    create_password = false
    keys            = [var.ssh_key_public]
  }
}
~ # UPCLOUD_USERNAME=<secret> UPCLOUD_PASSWORD=<secret> terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # upcloud_server.something01 will be created
  + resource "upcloud_server" "something01" {
      + cpu      = (known after apply)
      + firewall = false
      + hostname = "something01"
      + id       = (known after apply)
      + mem      = (known after apply)
      + metadata = true
      + plan     = "1xCPU-1GB"
      + title    = "something01"
      + zone     = "us-chi1"

      + login {
          + create_password   = false
          + keys              = [
              + "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIEldJlXojPrCK17MZK94hJam2Nhjwuj2wdFpZpqNGhVK",
            ]
          + password_delivery = "none"
        }

      + network_interface {
          + bootable            = false
          + ip_address          = (known after apply)
          + ip_address_family   = "IPv4"
          + ip_address_floating = (known after apply)
          + mac_address         = (known after apply)
          + network             = (known after apply)
          + source_ip_filtering = true
          + type                = "public"
        }
      + network_interface {
          + bootable            = false
          + ip_address          = (known after apply)
          + ip_address_family   = "IPv6"
          + ip_address_floating = (known after apply)
          + mac_address         = (known after apply)
          + network             = (known after apply)
          + source_ip_filtering = true
          + type                = "public"
        }
      + network_interface {
          + bootable            = false
          + ip_address          = (known after apply)
          + ip_address_family   = "IPv4"
          + ip_address_floating = (known after apply)
          + mac_address         = (known after apply)
          + network             = (known after apply)
          + source_ip_filtering = true
          + type                = "utility"
        }

      + storage_devices {
          + address = "virtio"
          + storage = (known after apply)
          + type    = "disk"
        }

      + template {
          + address = "virtio"
          + id      = (known after apply)
          + size    = 25
          + storage = "Ubuntu Server 20.04 LTS (Focal Fossa)"
          + tier    = (known after apply)
          + title   = (known after apply)
        }
    }

  # upcloud_storage.something01 will be created
  + resource "upcloud_storage" "something01" {
      + id    = (known after apply)
      + size  = 25
      + tier  = "maxiops"
      + title = "something01"
      + zone  = "us-chi1"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

upcloud_storage.something01: Creating...
upcloud_storage.something01: Still creating... [10s elapsed]
upcloud_storage.something01: Creation complete after 17s [id=019d9cba-7e26-4ff6-8d57-6b9d23f320be]
upcloud_server.something01: Creating...
upcloud_server.something01: Still creating... [10s elapsed]
upcloud_server.something01: Still creating... [20s elapsed]
upcloud_server.something01: Still creating... [30s elapsed]
upcloud_server.something01: Still creating... [40s elapsed]
upcloud_server.something01: Still creating... [50s elapsed]
upcloud_server.something01: Creation complete after 56s [id=008327d2-8608-4c26-bf37-76cc2ad813e4]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
~ # UPCLOUD_USERNAME=<secret> UPCLOUD_PASSWORD=<secret> terraform plan
upcloud_storage.something01: Refreshing state... [id=019d9cba-7e26-4ff6-8d57-6b9d23f320be]
upcloud_server.something01: Refreshing state... [id=008327d2-8608-4c26-bf37-76cc2ad813e4]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.
~ # 
```

A bit stumped by this now, I'll try to dig deeper.

I'll check the cloning and get back to you on that 😄 